In [104]:
course_threshold = 4

In [105]:
df.query("Courses>@course_threshold")

         Name Language  Courses
No
row0      Tom   Python        5
row2  Tiffany        R        7

In [106]:
df.query(f"Courses > {course_threshold}")

         Name Language  Courses
No
row0      Tom   Python        5
row2  Tiffany        R        7

In [74]:
df = pd.DataFrame(data={"Name": ["Tom", "Mike", "Tiffany"],
                   "Language": ["Python", "Python", "R"],
                   "Courses": [5, 4, 7]},
                  index=[f'row{_}' for _ in range(3)])
df.index.name = 'No'
df

         Name Language  Courses
No
row0      Tom   Python        5
row1     Mike   Python        4
row2  Tiffany        R        7

In [75]:
df['Language']

No
row0    Python
row1    Python
row2         R
Name: Language, dtype: object

In [76]:
df[['Language']]

     Language
No
row0   Python
row1   Python
row2        R

In [77]:
df[['Language','Name']]

     Language     Name
No
row0   Python      Tom
row1   Python     Mike
row2        R  Tiffany

In [78]:
df['Language':'Name'] #오류 (열은 불가능 - 행만 인식 가능)

Empty DataFrame
Columns: [Name, Language, Courses]
Index: []

In [79]:
df['row0':'row2'] #행 슬라이싱은 끝 값도 포함

         Name Language  Courses
No
row0      Tom   Python        5
row1     Mike   Python        4
row2  Tiffany        R        7

In [80]:
df

         Name Language  Courses
No
row0      Tom   Python        5
row1     Mike   Python        4
row2  Tiffany        R        7

In [81]:
df.iloc[1]

Name          Mike
Language    Python
Courses          4
Name: row1, dtype: object

In [82]:
df.iloc[[1,2]]

         Name Language  Courses
No
row1     Mike   Python        4
row2  Tiffany        R        7

In [83]:
df.iloc[0:1]

     Name Language  Courses
No
row0  Tom   Python        5

In [84]:
df.iloc[1:2,:]

      Name Language  Courses
No
row1  Mike   Python        4

In [85]:
df.loc['row0']

Name           Tom
Language    Python
Courses          5
Name: row0, dtype: object

In [88]:
df.loc['row1']

Name          Mike
Language    Python
Courses          4
Name: row1, dtype: object

In [89]:
df.loc[['row1']]

      Name Language  Courses
No
row1  Mike   Python        4

In [90]:
df.loc[['row0','row1'],['Courses','Language']]

      Courses Language
No
row0        5   Python
row1        4   Python

In [92]:
df.loc['row1',df.columns[2]]

4

In [93]:
df.loc[df.index[1],df.columns[2]] #행은 index, 열은 columns

4

In [94]:
df['Courses']>5

No
row0    False
row1    False
row2     True
Name: Courses, dtype: bool

In [98]:
df[df['Courses']>3][['Name','Courses']]

         Name  Courses
No
row0      Tom        5
row1     Mike        4
row2  Tiffany        7

In [100]:
df[(df['Courses'] > 4) & (df['Language'] == 'Python')]

     Name Language  Courses
No
row0  Tom   Python        5

In [99]:
df[(df.Courses > 4) & (df.Language == 'Python')]

     Name Language  Courses
No
row0  Tom   Python        5

In [102]:
df.query('Courses>4 & Language=="Python"')

     Name Language  Courses
No
row0  Tom   Python        5

In [107]:
pd.read_csv

<function pandas.io.parsers.readers.read_csv(filepath_or_buffer: 'FilePathOrBuffer', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=False, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)>

In [11]:
import pandas as pd
import numpy as np

In [12]:
pd.Series(data=[1,2,3])

0    1
1    2
2    3
dtype: int64

In [14]:
s = pd.Series(data=[1,2,3], index=['a','b','c'])

In [15]:
s

a    1
b    2
c    3
dtype: int64

In [16]:
s.name = 'my_series'
s.index.name = 'my_index'
s

my_index
a    1
b    2
c    3
Name: my_series, dtype: int64

In [23]:
s = pd.Series(data={'김':90, '박':80, '최':70}, name='성적')
s.index.name='학생'
s

학생
김    90
박    80
최    70
Name: 성적, dtype: int64

In [24]:
s['박']

80

In [25]:
pd.Series(data=np.random.randn(5))

0    1.125929
1   -0.400884
2    1.445144
3   -0.968528
4    0.055770
dtype: float64

In [26]:
s

학생
김    90
박    80
최    70
Name: 성적, dtype: int64

In [27]:
s.name

'성적'

In [28]:
s.rename('점수')

학생
김    90
박    80
최    70
Name: 점수, dtype: int64

In [29]:
s.index

Index(['김', '박', '최'], dtype='object', name='학생')

In [31]:
s.to_numpy() #시리즈를 넘파이 배열로 변환

array([90, 80, 70], dtype=int64)

In [34]:
pd.Series([[1,2,3],"b",1]).to_numpy()

array([list([1, 2, 3]), 'b', 1], dtype=object)

In [36]:
s = pd.Series(data = range(5),
              index = ['A', 'B', 'C', 'D', 'E'])
s

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [37]:
s[3]

3

In [38]:
s[[2,3,0]]

C    2
D    3
A    0
dtype: int64

In [39]:
s[2:5]

C    2
D    3
E    4
dtype: int64

In [40]:
s["D"]

3

In [41]:
s[["A","C","E"]]

A    0
C    2
E    4
dtype: int64

In [42]:
s["A":"C"]

A    0
B    1
C    2
dtype: int64

In [44]:
s[0:2]

A    0
B    1
dtype: int64

In [45]:
'F' in s

False

In [46]:
s.isin([2]) #하나 짜리는 리스트 형태로 감싸줘야 값 나옴

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [47]:
s.isin((2,3)) #여러개는 튜플 형태로도 가능

A    False
B    False
C     True
D     True
E    False
dtype: bool

In [48]:
s > 1

A    False
B    False
C     True
D     True
E     True
dtype: bool

In [50]:
s[s>=1]

B    1
C    2
D    3
E    4
dtype: int64

In [51]:
s[s!=1]

A    0
C    2
D    3
E    4
dtype: int64

In [52]:
s[s>s.mean()]

D    3
E    4
dtype: int64

In [53]:
s

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [56]:
s['E'] = np.NaN
s

A    0.0
B    1.0
C    2.0
D    3.0
E    NaN
dtype: float64

In [57]:
pd.isna(s)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [58]:
pd.isnull(s)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [59]:
s.isnull()

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [60]:
s.isna()

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [62]:
#help(pd.Series)

In [63]:
s1 = pd.Series(data=range(4), index=["A", "B", "C", "D"])
s1

A    0
B    1
C    2
D    3
dtype: int64

In [67]:
s1.add(3.14).pow(2).mean()

22.779600000000002

In [71]:
pd.DataFrame(
    data={'no':np.arange(1,4),
         'height':[170,180,160],
         'weight':[70,82,63]},
    index=['no'+str(_) for _ in range(1,4)])

     no  height  weight
no1   1     170      70
no2   2     180      82
no3   3     160      63

In [73]:
for t in zip(['Tom', 'Mike', 'Tiffany'],[7,15,3]):
    print(t)

('Tom', 7)
('Mike', 15)
('Tiffany', 3)